In [2]:
import word2number
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt

In [52]:
df=pd.read_csv("hiring.csv")
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '').str.replace('$','')
df.columns
df

  experience  test_scoreout_of_10  interview_scoreout_of_10  salary
0        NaN                  8.0                         9   50000
1        NaN                  8.0                         6   45000
2       five                  6.0                         7   60000
3        two                 10.0                        10   65000
4      seven                  9.0                         6   70000
5      three                  7.0                        10   62000
6        ten                  NaN                         7   72000
7     eleven                  7.0                         8   80000

In [53]:
import math
df.experience = df.experience.fillna("zero")

#df.test_scoreout_of_10=df.test_scoreout_of_10.fillna(test_median)

In [54]:
import math
test_mean=math.floor(df.test_scoreout_of_10.mean())
test_mean
#df.test_scoreout_of_10=df.test_scoreout_of_10.fillna()

7

In [55]:
df.test_scoreout_of_10=df.test_scoreout_of_10.fillna(test_mean)

In [56]:
df

  experience  test_scoreout_of_10  interview_scoreout_of_10  salary
0       zero                  8.0                         9   50000
1       zero                  8.0                         6   45000
2       five                  6.0                         7   60000
3        two                 10.0                        10   65000
4      seven                  9.0                         6   70000
5      three                  7.0                        10   62000
6        ten                  7.0                         7   72000
7     eleven                  7.0                         8   80000

In [57]:
from word2number import w2n
df.experience=df.experience.apply(w2n.word_to_num)

In [58]:
df

   experience  test_scoreout_of_10  interview_scoreout_of_10  salary
0           0                  8.0                         9   50000
1           0                  8.0                         6   45000
2           5                  6.0                         7   60000
3           2                 10.0                        10   65000
4           7                  9.0                         6   70000
5           3                  7.0                        10   62000
6          10                  7.0                         7   72000
7          11                  7.0                         8   80000

In [60]:
reg = linear_model.LinearRegression()

In [62]:
reg.fit(df[['experience','test_scoreout_of_10','interview_scoreout_of_10']],df['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [63]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [64]:
reg.predict([[12,10,10]])

array([93747.79628651])